

// СТРОКИ

// length — длина строки  

// toLowerCase — нижний регистр  

// toUpperCase — верхний регистр  

// split — разбиение строки на массив  

// substr — вырезание подстроки  

// substring — вырезание подстроки  

// slice — вырезание подстроки  

// concat — объединение строк  

// indexOf — поиск совпадений с начала  

// lastIndexOf — поиск совпадений с конца  

// startsWith — проверка начала  

// endsWith — проверка конца  

// trim — удаление пробелов по краям  

// charAt — символ строки  

// charCodeAt — символ по его коду  

// String.fromCharCode — код символа  

// replace — поиск и замена  

// at — символ строки по позиции  

// padEnd — дополнение строки с конца до заданной длины  

// padStart — дополнение строки с начала до заданной длины  

// repeat — создание копий строки  

// trimEnd — удаление пробелов в конце строки  

// trimStart — удаление пробелов в начале строки  

// includes — поиск заданной строки в текущей строке  

// Регулярные выражения

// replace — поиск и замена регуляркой  

// match — совпадения по регулярке  

// matchAll — все совпадения по регулярке  

// exec — последовательный поиск  

// test — проверка регуляркой  

// search — поиск регуляркой  

// split — разбиение строки на массив  

